<a href="https://colab.research.google.com/github/mtfaye/algo_toolbox/blob/master/Copy_of_dh_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Dunnhumby - Python Test**

 I will approach the questions of this exercice by thinking of their application in a real world and in a larger scale of data. So I will be considering of building, if necessary re-usable functions to provide my answers.
  I will try also to put as much as possible comprehensible comments to better explain the code written and the modules used.

# Section 1: General Python

In [0]:
basket_values = [3.43,9.73,7.56,9.52,15.23,2.25,6.44,7.38]

### 1 - a. Print out whether each basket is:
small (basket value < £5),
medium (£5 ≤ basket value < £10) 
or large (basket value ≥ £10)

In [0]:
def basket_size(given_list):
  # re-usable function that print out size of values for any given list 

  for i in given_list:
    if i < 5:
      print('Small : ',i)
    if i >= 10:
      print('Large : ',i)
    if i >= 5 and i <10:
      print('Medium: ',i)

In [0]:
# use the function with basket_values list
basket_size(basket_values)

Small :  3.43
Medium:  9.73
Medium:  7.56
Medium:  9.52
Large :  15.23
Small :  2.25
Medium:  6.44
Medium:  7.38

### 1 - b. Sum and print the value of the medium value baskets.

In [0]:
def mysum(basket_values):
    # function that sum all the medium values baskets and return the total
    
    running_total = 0
    # iterating on the list
    for i in basket_values:
      # selecting the values that match the condition
      if i >= 5 and i <10:
        # adding the values selected to sum 
        running_total = running_total + i
    return running_total

In [0]:
mysum(basket_values)

40.63

## 2. You are given the following nested dictionaries, which represent items in a basket:

In [0]:
basket = {
          '2624': {'price': 0.5, 'prod_name': 'salt'},
          '2894': {'price': 3.25, 'prod_name': 'yeast'},
          '7527': {'price': 2.5, 'prod_name': 'flour'}
          }

### 2 - a. Return the product name for item 7527.

In [0]:
# access nested dict using indexing 
basket['7527']['prod_name']

'flour'

### 2 - b. Return the total value of this basket.

In [0]:
sum = 0
# iterating key value pair 
for key, value in basket.items(): 

    if value and 'price' in value.keys(): 
        # adding value of price to sum 
        sum += value['price']

In [0]:
sum

6.25

### 2 - c. Add another entry for a product that costs £4.95, has ID 7524 and name ‘poppy seeds’.

In [0]:
# insert new dict into basket
basket['7524'] = {'price': 4.95, 'prod_name': 'poppy seeds'}

In [0]:
# print the updated basket
basket

{'2624': {'price': 0.5, 'prod_name': 'salt'},
 '2894': {'price': 3.25, 'prod_name': 'yeast'},
 '7524': {'price': 4.95, 'prod_name': 'poppy seeds'},
 '7527': {'price': 2.5, 'prod_name': 'flour'}}

## 3. Below is the source code for a function called ‘get_sql_string’.

In [0]:
'''

def get_sql_string(stores):
    store_names = [x.split(', ')[0] for x in stores]
    store_names = [x.replace(' ', '_') for x in store_names]
    store_regions = [x.split(', ')[1] for x in stores]
    locations = store_names + store_regions
    columns = ['sales_' + x.lower() for x in locations]
    
    return ', '.join(columns)

    '''

"\n\ndef get_sql_string(stores):\n    store_names = [x.split(', ')[0] for x in stores]\n    store_names = [x.replace(' ', '_') for x in store_names]\n    store_regions = [x.split(', ')[1] for x in stores]\n    locations = store_names + store_regions\n    columns = ['sales_' + x.lower() for x in locations]\n    \n    return ', '.join(columns)\n\n    "

### 3 - a. There is a bug in line 4. What should the line be?

- After compiling the function I actually found out that it is not throwing error the function is actually working.
Now question is: Is the function doing what we want it to do? 

- After looking at it, I am assuming that we are trying to create a new column which have the sales of each store location.
So the function consist to attach the word sales to the stores names with an underscores '_' , also attach all the words in the stores names with an underscored '_' and split the stores names to the stores regions into two different strings.
- Now line 4, is to split the string combination of stores names and stores regions a string into a list where each of the stores names and stores regions is a list item.

Line 4 looks fine to me! 
Instead of returning the join function with a comma ',' separator, I returned the column itself.
Look the result in the following question.

### 3 - b. Assuming this bug was fixed, what would be returned if the following command was executed?

my_stores = ['Fulham Palace Rd, Hammersmith', 'Crown St, Reading', 'Leavesden Green, Watford']

get_sql_string(my_stores)

In [0]:
# my updated function
def get_sql_string(stores):
  store_names = [x.split(', ')[0] for x in stores]
  store_names = [x.replace(' ', '_') for x in store_names]
  store_regions = [x.split(',')[1] for x in stores]
  locations = store_names + store_regions
  columns = ['sales_' + x.lower() for x in locations]
  
  return columns

In [0]:
# The function return a list of sales stores name and sales  regions.
# Hopefully this was the goal of the function 

my_stores = ['Fulham Palace Rd, Hammersmith', 'Crown St, Reading', 'Leavesden Green, Watford']
get_sql_string(my_stores)

['sales_fulham_palace_rd',
 'sales_crown_st',
 'sales_leavesden_green',
 'sales_ hammersmith',
 'sales_ reading',
 'sales_ watford']

## 4. Write a function that:

         a. accepts a list of strings as input;

         b. returns an alphabetically ordered list of unique strings;

         c. prints the string(s) with maximum length in the console.

In [0]:
# create a list of strings
string_list = ['dgddfg', 'sdf', 'ffs', 'asdd', 'hdfsdgsdggsdgdgd']

In [0]:
def get_maxsort(string_list):
# function that takes a list of strings, sort it and prints  the max length

  # use python max function to return the max length
  print('Max length:\n')
  print(max(string_list, key=len))
  print('\n')
  
  # use python sort function to order element alphabetically
  new_list = sorted(string_list)
  print('Alphabetically ordered:\n')
  return new_list

In [8]:
get_maxsort(string_list)

Max length:

hdfsdgsdggsdgdgd


Alphabetically ordered:

['asdd', 'dgddfg', 'ffs', 'hdfsdgsdggsdgdgd', 'sdf']

# Section 2: pandas data frames

In [0]:
# lets reproduce the 3 first columns of DEPT AND EMPLOYEE dataframes for a better illustration of this exercise

In [0]:
# necessary dependencies for this exercise
import pandas as pd
import datetime

In [0]:
data ={
    'DEPTNO':[12, 7, 23], 'DNAME':['Finance', 'Operations', 'Marketing'], 'LOC':['London', 'Edinburgh', 'Paris']
}
dept = pd.DataFrame(data)
dept

   DEPTNO       DNAME        LOC
0      12     Finance     London
1       7  Operations  Edinburgh
2      23   Marketing      Paris

In [0]:
data_1 = {
    'EMPNO':[3697, 5684, 1891], 'ENAME':['Smith', 'Davis', 'Jones'], 'JOB':['Developer', 'Manager', 'Analyst'],
    'MGR':[5684, 8257, 5684], 'HIREDATE':['05/05/15', '22/03/09', '01/09/17'], 'SAL': [47000.00, 63000.00, 20000.00],
    'DEPTNO':[11, 11, 23]
}
employee = pd.DataFrame(data_1)
employee

   EMPNO  ENAME        JOB   MGR  HIREDATE      SAL  DEPTNO
0   3697  Smith  Developer  5684  05/05/15  47000.0      11
1   5684  Davis    Manager  8257  22/03/09  63000.0      11
2   1891  Jones    Analyst  5684  01/09/17  20000.0      23

## 1. Find the nth largest salary.

In [0]:
# use built-in pandas method: nlargest 
# n is the number of row to return
# for instance if n=5 the 5 highest salary will be returned
n= 1
employee.nlargest(n, ['SAL'])   # NOTE THAT THIS WILL RETURN A DATAFRAME

   EMPNO  ENAME      JOB   MGR  HIREDATE      SAL  DEPTNO
1   5684  Davis  Manager  8257  22/03/09  63000.0      11

In [0]:
# Now if we want to return a list of values of the highest salary
# We can slice the dataframe by indexing (note that n is still equal to 1)
employee.nlargest(n, ['SAL'])['SAL']

1    63000.0
Name: SAL, dtype: float64

## 2. List the highest salary paid for each job.

In [0]:
# using groupby method
employee.groupby('JOB')['SAL'].max()

JOB
Analyst      20000.0
Developer    47000.0
Manager      63000.0
Name: SAL, dtype: float64

### 3. In which year did most people join the company? Display the year and the number of Employees.

In [0]:
# count the frequence of occurence for each date on the dataframe 
# sort the list descending: from the year that appears the most to the year that appear the least
# and then filter the first row of the list 
employee['HIREDATE'].value_counts(sort=True).head(1)

01/09/17    1
Name: HIREDATE, dtype: int64

### 4. Create a new column with the length of service of the Employees (in the form n years and m months).

In [0]:
# first lets create a column of today's date using datetime module
employee['TODAY_DATE'] = datetime.date.today().strftime("%d/%m/%y")

In [0]:
def get_diff(td):
# function that calculates years and months difference

    # get the number of years 
    nYear = float(td.days)/364.0 
    nYear = int(nYear)
    # get the number of months               
    nMonth = int((nYear - int(nYear))*364/30)  
   
    # concat characters
    return str(nYear) + 'y' + str(nMonth) + 'm'

In [0]:
# create the LEN_OF_SERVICE column and add the values
employee['LEN_OF_SERVICE'] = [get_diff(datetime.datetime.strptime(TODAY_DATE, '%d/%m/%y') - datetime.datetime.strptime(HIREDATE,'%d/%m/%y'))\
               for HIREDATE, TODAY_DATE in zip(
                   employee['HIREDATE'],
                    employee['TODAY_DATE']
                    )
               ]

In [0]:
# see result
employee

   EMPNO  ENAME        JOB   MGR  ...      SAL  DEPTNO  TODAY_DATE LEN_OF_SERVICE
0   3697  Smith  Developer  5684  ...  47000.0      11    09/01/20           4y0m
1   5684  Davis    Manager  8257  ...  63000.0      11    09/01/20          10y0m
2   1891  Jones    Analyst  5684  ...  20000.0      23    09/01/20           2y0m

[3 rows x 9 columns]

## 5. List all the Employees who have at least one person reporting to them.

In [0]:
# value_counts() method count the frequence of occurence 
# if we apply it to column MGR, it will return the number of time each employee number MGR is assign to an employee
employee['MGR'].value_counts()

5684    2
8257    1
Name: MGR, dtype: int64

## 6. Calculate and list the Employees who earn more than the average salary of their department.

In [0]:
#Create a new column 'MEAN_SAL' which have the average salary for each employee's department
mean_salary = employee.groupby('DEPTNO')['SAL'].aggregate('mean').rename('MEAN_SAL').reset_index()

In [0]:
# Merge the column
employee = employee.merge(mean_salary)

In [0]:
# Create a 2nd column 'IS_ABOVE_AVG_SALARY' which have Boolean values: True when is above average and false when is not
employee['IS_ABOVE_AVG_SALARY'] = employee['MEAN_SAL'] < employee['SAL']

In [0]:
# Filter all the True values from IS_ABOVE_AVG_SALARY column
# THIS WILL RETURN A DATAFRAME OF THE EMPLOYEES WHO EARN MORE THAN THE AVG SALARY OF THEIR DEPARTMENT
employee.loc[employee.IS_ABOVE_AVG_SALARY == True]

   EMPNO  ENAME      JOB  ...  LEN_OF_SERVICE MEAN_SAL  IS_ABOVE_AVG_SALARY
1   5684  Davis  Manager  ...           10y0m  55000.0                 True

[1 rows x 11 columns]